/***********************************************************************************
 * 文 件 名   : common_sock.h
 * 负 责 人   : xwq
 * 创建日期   : 2024年5月14日
 * 文件描述   : common_sock.c 的头文件
 * 版权说明   : Copyright (c) 2015-2029  SWITCHBOT SHENZHEN IOT
 * 字符编码   : UTF-8
 * 修改日志   :
 ***********************************************************************************/

#ifndef __COMMON_SOCK_H__
#define __COMMON_SOCK_H__
/*----------------------------------------------*
 * 包含头文件                                           *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                              *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                          *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif /* __cplusplus */

extern int Common_socket_close(int sockfd);
extern int Common_socket(int protocolType);
int Comm_socket_select_rwset(int socket, int *readable, int *writeable);
int Comm_sock_send_data(int socket, unsigned char *data, int needSendSize, int *realSendSize);
int Comm_sock_recv_data(int sockfd, unsigned char *rBuf, int needReadLen, int *readLen);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */

#endif /* __COMMON_SOCK_H__ */
